[
  {
    "id": "e1-01",
    "level": 1,
    "difficulty": "beginner",
    "lang": "en",
    "title": "Morning Routine",
    "preview": "I wake up early and brew a warm cup of tea",
    "text": "I wake up early and brew a warm cup of tea. The quiet kitchen feels like a tiny harbor before the day begins. I stretch, breathe slowly, and plan a simple to-do list."
  },
  {
    "id": "e2-01",
    "level": 2,
    "difficulty": "beginner",
    "lang": "en",
    "title": "City Walk at Noon",
    "preview": "At noon, the city hums with energy and chatter",
    "text": "At noon, the city hums with energy and chatter. I walk past a park where children play tag, and a street musician plays a bright tune. I grab a sandwich and sit on a sunny bench."
  },
  {
    "id": "e3-01",
    "level": 3,
    "difficulty": "beginner",
    "lang": "en",
    "title": "The Library in Rain",
    "preview": "Rain taps on the old library windows as readers settle",
    "text": "Rain taps on the old library windows as readers settle into cozy corners. Pages turn like gentle waves, and the air smells of paper and time. I find a well-worn book, underline a thoughtful line, and feel quietly renewed."
  },
  {
    "id": "e2-02",
    "level": 2,
    "difficulty": "intermediate",
    "lang": "en",
    "title": "Essay 1 – Studying Alone or in Groups",
    "preview": "Studying is an essential part of academic success",
    "text": "Studying is an essential part of academic success, and people often debate whether it is better to study alone or in groups. Personally, I believe that studying in groups is more effective because students can share ideas and explain difficult concepts to each other. For example, if one person does not understand a math problem, another member of the group might provide a clear explanation. In addition, group study creates motivation since seeing others work hard encourages everyone to stay focused, while studying alone sometimes feels isolating and makes it easier to lose concentration. In conclusion, I strongly prefer group study because it allows for collaboration, mutual support, and higher motivation."
  },
  {
    "id": "e3-02",
    "level": 3,
    "difficulty": "advanced",
    "lang": "en",
    "title": "Essay 2 – Cell Phones in Classrooms",
    "preview": "The role of cell phones in classrooms has been a controversial issue",
    "text": "The role of cell phones in classrooms has been a controversial issue. Some argue that they are a distraction, while others believe they can be powerful learning tools. Cell phones can indeed cause students to lose focus if they use them for games or social media during class; however, if used responsibly, they can support learning by allowing students to quickly search for information, use language-learning applications, or access digital textbooks. Teachers can also integrate phones into lessons by encouraging students to use them for research, so the benefits really depend on how they are managed. Overall, I think cell phones should be allowed in classrooms but with clear rules, because when used wisely they can become valuable educational tools rather than sources of distraction."
  },
  {
    "id": "e3-03",
    "level": 3,
    "difficulty": "advanced",
    "lang": "en",
    "title": "Essay 3 – Working from Home or in the Office",
    "preview": "In recent years, working from home has become more common",
    "text": "In recent years, working from home has become more common, and some people prefer the flexibility of remote work while others value the structure of an office. Working from home saves commuting time and allows employees to balance personal and professional life more easily, and parents, for instance, can spend more time with their children while still completing their tasks. However, the office environment provides better communication, teamwork, and stronger social connections, and some people find it easier to concentrate in a professional setting without home distractions. In conclusion, both options have benefits, but I believe a hybrid model is the best solution since it allows employees to enjoy flexibility while still maintaining collaboration and productivity."
  },
  {
    "id": "e3-04",
    "level": 3,
    "difficulty": "advanced",
    "lang": "en",
    "title": "Essay 4 – Reading Books or Watching Movies",
    "preview": "Entertainment plays a significant role in our lives",
    "text": "Entertainment plays a significant role in our lives, and many people enjoy either reading books or watching movies, but I personally prefer reading books because they offer a deeper experience. Books allow readers to imagine the setting, characters, and emotions in their own way, which makes the experience more personal, and reading also improves vocabulary and writing skills. Although movies are faster and more visually stimulating, they often shorten or simplify the story; for instance, when I read a novel and later watched its movie version, I found that many important details were missing. Therefore, while movies are entertaining, books provide more detail, creativity, and personal growth, which makes reading a more rewarding choice."
  },
  {
    "id": "e2-03",
    "level": 2,
    "difficulty": "intermediate",
    "lang": "en",
    "title": "Essay 5 – Living in a Big City or Small Town",
    "preview": "The choice between living in a big city or a small town",
    "text": "The choice between living in a big city or a small town depends on personal preference, but in my opinion living in a big city is more beneficial because of the opportunities it provides. Big cities offer better job prospects, advanced healthcare, and more educational institutions, and students have access to libraries, universities, and cultural activities such as museums and theaters. Small towns may provide peace and a slower lifestyle, which some people enjoy, but I believe the advantages of cities outweigh the disadvantages, especially for young people seeking career growth. In conclusion, although small towns have their charm, big cities provide more opportunities and resources, which makes them the better choice for most people."
  },
  {
    "id": "e4-01",
    "level": 4,
    "difficulty": "intermediate",
    "lang": "en",
    "title": "對比觀點類",
    "preview": "Some people believe that ... is a positive thing, while others argue",
    "text": "Some people believe that ... is a positive thing, while others argue that it has more negative effects. In my opinion, ... plays a crucial role in ..., but we should also be aware of its potential drawbacks. On the one hand, ... can bring numerous benefits, such as..., and it is undeniable that. However, on the other hand, ... may also lead to several problems like..., and we cannot ignore the fact that ... can sometimes have adverse effects. We should weigh the pros and cons carefully before making a decision."
  },
  {
    "id": "e4-02",
    "level": 4,
    "difficulty": "intermediate",
    "lang": "en",
    "title": "解決問題類",
    "preview": "Recently, the issue of ... has become increasingly prominent",
    "text": "Recently, the issue of ... has become increasingly prominent. Many people are concerned about its impact on society and are eager to find effective solutions. To address this problem, several measures can be taken. Firstly, ... can be implemented to reduce its negative effects. Secondly, raising public awareness is also crucial, as it can help people understand the importance of ... and encourage them to take action. Finally, the government should play a leading role. For example..., formulating policies and regulations to ensure that the problem is properly addressed."
  },
  {
    "id": "e4-03",
    "level": 4,
    "difficulty": "advanced",
    "lang": "en",
    "title": "現象分析類",
    "preview": "With the rapid development of ..., the phenomenon of... has attracted",
    "text": "With the rapid development of ..., the phenomenon of... has attracted widespread attention. Many people have different opinions about it. Some view it as a positive trend, believing that it brings new opportunities and challenges. Others, however, are concerned about its negative impact on society. In my view, ...is a double-edged sword. While it provides us with convenience and efficiency. For example, it also brings a series of problems that need to be addressed. For instance therefore, we should approach this phenomenon with a rational attitude and seek balanced development."
  },
  {
    "id": "e4-04",
    "level": 4,
    "difficulty": "intermediate",
    "lang": "en",
    "title": "個人經歷類",
    "preview": "In my personal experience, ... has had a profound impact on my life",
    "text": "In my personal experience, ... has had a profound impact on my life. It was during ... when I first encountered ...and realized its importance. Since then, I have been actively involved in ..., and this experience has not only broadened my horizons but also taught me valuable life lessons. Through ..., I learned to ... and this skill has been invaluable in my subsequent endeavors. I believe that everyone should have the opportunity to experience ..., as it can truly change one's perspective on life."
  },
  {
    "id": "e4-05",
    "level": 4,
    "difficulty": "advanced",
    "lang": "en",
    "title": "觀點闡述",
    "preview": "In my opinion, ...is an essential aspect of ... that cannot be overlooked",
    "text": "In my opinion, ...is an essential aspect of ... that cannot be overlooked. It not only plays a crucial role in ... but also has a profound impact on our daily lives. The importance of ... lies in its ability to ..., and this is something that we should all cherish and promote. For example... we can..., and this will ultimately benefit society as a whole. Therefore, I strongly believe that ... should be given more attention and support."
  },
  {
    "id": "e4-06",
    "level": 4,
    "difficulty": "intermediate",
    "lang": "en",
    "title": "環境保護類 我愛你",
    "preview": "Environmental protection is a global issue that concerns everyone",
    "text": "Environmental protection is a global issue that concerns everyone. With the increasing pollution and destruction of our planet, it is crucial that we take action to protect our environment. One way to do this is by ..., which can significantly reduce the impact of human activities on the natural world. Additionally, raising awareness about environmental issues is also important, as it can encourage more people to get involved in conservation efforts. Together, we can make a difference and ensure a sustainable future for our planet."
  }
]


